[{"Name":"Adaptability","Desc":"Increases the user's STAB multiplier from 1.5x to 2.0x instead."},{"Name":"Aftermath","Desc":"The opponent that dealt the finishing hit to the user loses 25% of its max HP if it made a physical contact with the user."},{"Name":"Analytic","Desc":"The user's attack power is increased by 30%, if the user is the last to attack this turn."},{"Name":"Anger Point","Desc":"The user gets their Attack stat increased by 6 stages after receiving a critical hit."},{"Name":"Anger Shell","Desc":"When the Pokemon's HP drops below 50% or less, its Defense and Special Defense stats are lowered by one stage, but its Attack, Special Attack, and Speed stats are raised by one stage."},{"Name":"Anticipation","Desc":"This ability warns the user if their opponent knows a 1-hit KO or super effective move."},{"Name":"Arena Trap","Desc":"This ability stops opponents from escaping but Flying-type Pokemon, Ghost-type Pokemon that are not grounded, and those with the Levitate ability or under the effects of items or moves that make them ungrounded are unaffected."},{"Name":"Armor Tail","Desc":"It makes opposing Pokémon unable to use priority moves."},{"Name":"Aroma Veil","Desc":"Protects the user and allies from attacks that would limit their move choices."},{"Name":"Battle Armor","Desc":"The user is protected from critical hits."},{"Name":"Beads of Ruin","Desc":"Lowers the Special Defense stat of all Pokemon in the field by 25%."},{"Name":"Big Pecks","Desc":"Protects the user from Defense lowering effects."},{"Name":"Blaze","Desc":"Increases the damage of Fire-type moves by 50% when the user's HP is below 1/3 its max."},{"Name":"Bulletproof","Desc":"Protects the user from bullet, ball, and bomb moves."},{"Name":"Cheek Pouch","Desc":"Heals the user 33% of its max HP whenever they eat a Berry."},{"Name":"Chlorophyll","Desc":"Increases the user's Speed stat under sunshine."},{"Name":"Clear Body","Desc":"Prevents other Pokemon from lowering the user's stats."},{"Name":"Cloud Nine","Desc":"Weather effects are negated while the user is on the field."},{"Name":"Comatose","Desc":"The user is always treated as if asleep but can still attack normally. Attacks and abilities affected by Sleep still apply, including Sleep Talk, Snore, Hex, Wake-Up Slap, Dream Eater, Nightmare, and Bad Dreams."},{"Name":"Commander","Desc":"The Pokemon enters an ally Dondozo's mouth if one is in battle and will not be damaged from attacks. Afterwards, Dondozo cannot be switched out but all of its stats will be raised by two stages."},{"Name":"Competitive","Desc":"Increases the user's Special Attack by two stages when the user's stats get lowered."},{"Name":"Compound Eyes","Desc":"Increases the user's accuracy by 30%."},{"Name":"Contrary","Desc":"Moves that changes stats now have the opposite effect."},{"Name":"Corrosion","Desc":"The user can now poison Steel-type and Poison-type opponents."},{"Name":"Costar","Desc":"The Pokemon copies an ally's stat changes when it enters the field."},{"Name":"Cud Chew","Desc":"When a Pokemon eats a Berry, it will eat the Berry again at the end of the next turn."},{"Name":"Cursed Body","Desc":"Has a 30% chance to disable the opponent's move that damages the user."},{"Name":"Cute Charm","Desc":"Has a 30% chance to cause the opponent to be infatuated with the user if the opponent makes physical contact with the user."},{"Name":"Damp","Desc":"Prevents the use of explosive, self-destructing moves while the user is in the battlefield."},{"Name":"Dancer","Desc":"When another Pokemon uses a dance move, the user immediately copies that move after."},{"Name":"Dazzling","Desc":"Prevents the opponent from using moves that have an increased Speed priority."},{"Name":"Defiant","Desc":"Increases the user's Attack by two stages when the user's stats get lowered."},{"Name":"Disguise","Desc":"Once per battle, the user is protected by its Disguise from one damaging attack move. Does not protect against entry hazards or weather damage. The user loses 12.5% of its max HP if the Disguise breaks."},{"Name":"Drizzle","Desc":"The user changes the weather to Rain for five turns."},{"Name":"Drought","Desc":"The user changes the weather to Harsh Sunlight for five turns."},{"Name":"Dry Skin","Desc":"Restores the user's HP in rain or when hit by Water-type moves. Reduces the user's HP in sunshine and increases the damage received from Fire-type moves."},{"Name":"Early Bird","Desc":"The user gets out of the Sleep condition twice as fast."},{"Name":"Earth Eater","Desc":"The Pokemon is unaffected by Ground-type moves, and instead heals 1/4 of its max HP when hit with a Ground-type attack."},{"Name":"Effect Spore","Desc":"Has 10% chance to Paralyze, Poison, or put the opponent to Sleep if it attacks the user with a physical move."},{"Name":"Electric Surge","Desc":"The user applies Electric Terrain to the battlefield for five turns when it enters a battle."},{"Name":"Electromorphosis","Desc":"The user becomes charged when hit by an attack, boosting the power of the next Electric-type move it uses."},{"Name":"Filter","Desc":"Reduces the damage taken from super effective moves by 25%."},{"Name":"Flame Body","Desc":"Has a 30% chance to burn the opponent if it attacks the user with a physical move."},{"Name":"Flare Boost","Desc":"Increases Special Attack by 50% when the user is burned."},{"Name":"Flash Fire","Desc":"Increases the damage from Fire-type moves by 50% if the user is hit with a Fire-type move. Once activated the user becomes immune to Fire-type attacks."},{"Name":"Flower Veil","Desc":"Ally Grass-type Pokemon are protected from attacks that cause status conditions or lower stats."},{"Name":"Fluffy","Desc":"Reduces damage taken by the user from physical moves but doubles the damage received from Fire-type moves."},{"Name":"Forewarn","Desc":"The user reveals the opponent's strongest move when it goes into battle."},{"Name":"Friend Guard","Desc":"The user reduces the damage received by allies."},{"Name":"Frisk","Desc":"The user can check the opponent's held item when it enters the battlefield."},{"Name":"Gale Wings","Desc":"This ability prioritizes Flying-type moves when the user's HP is full."},{"Name":"Gluttony","Desc":"The user will use a Berry when its HP drop below 50%, which is earlier than usual."},{"Name":"Good as Gold","Desc":"The Pokemon is immune from all status moves."},{"Name":"Gooey","Desc":"Lowers the opponent's Speed by one stage if it makes physical contact with the user."},{"Name":"Grass Pelt","Desc":"Increases the user's Defense by 50% when battling in Grassy Terrain."},{"Name":"Guard Dog","Desc":"The Pokemon's Attack stat is raised by one stage if it is affected by Intimidate. The Pokemon also ignores the effects of moves or items that force it to be switched out."},{"Name":"Guts","Desc":"Increases the user's Attack by 50% if it has a status condition."},{"Name":"Hadron Engine","Desc":"The user summons Electric Terrain for five turns, and boosts its Special Attack stat by 30% while said terrain is active."},{"Name":"Harvest","Desc":"Has a 50% chance to restore a Berry after consumption, in Sunny weather this chance increases to 100%."},{"Name":"Healer","Desc":"Has a 30% chance to cure an ally's status condition at the end of a turn."},{"Name":"Heatproof","Desc":"Damage received by the user from Fire-type moves and the Burn status condition is reduced in half."},{"Name":"Heavy Metal","Desc":"Doubles the weight of the user."},{"Name":"Honey Gather","Desc":"The user may pick up Honey after a battle, the higher the user's level the higher the chance of getting Honey."},{"Name":"Huge Power","Desc":"Doubles the user's Attack stat."},{"Name":"Hustle","Desc":"Increases the user's Physical Attack damage by 50% but lowers Accuracy by 20%."},{"Name":"Hydration","Desc":"The user heals status conditions when it is raining."},{"Name":"Hyper Cutter","Desc":"The user's Attack stat cannot be lowered by other Pokemon."},{"Name":"Ice Body","Desc":"The user gradually heals 6.25% of its max HP in a hailstorm."},{"Name":"Ice Face","Desc":"The user has a protective barrier against Physical Attacks once, Confusion can also break the barrier. The barrier is restored during Hail."},{"Name":"Ice Scales","Desc":"Reduces the damage taken by the user from Special Attacks."},{"Name":"Illusion","Desc":"The user enters battle disguised as the last non-fainted Pokemon in the party. The disguise breaks when the user receives damage from an attack but not from weather effects or entry hazards."},{"Name":"Immunity","Desc":"The user cannot be poisoned."},{"Name":"Imposter","Desc":"The user transforms into the Pokemon it's battling."},{"Name":"Infiltrator","Desc":"The user ignores the opponent's protective moves and stat boosts from moves."},{"Name":"Inner Focus","Desc":"The user is deeply focused and protects itself from flinching."},{"Name":"Insomnia","Desc":"The user cannot fall asleep."},{"Name":"Intimidate","Desc":"The user lower's the opponent's Attack by one stage whenever it enters the battlefield."},{"Name":"Iron Fist","Desc":"Increases the damage done by punching moves by 20%."},{"Name":"Justified","Desc":"The user's Attack is increased by one stage whenever it gets hit by Dark-type moves."},{"Name":"Keen Eye","Desc":"The user ignores the opponent's Evasion boosts and opponents cannot lower the user's Accuracy."},{"Name":"Klutz","Desc":"The user cannot use any held items except those that affect experience, EVs, prize money, and friendship."},{"Name":"Leaf Guard","Desc":"The user prevents status conditions under sunny weather."},{"Name":"Levitate","Desc":"The user is immune to Ground-type moves and cannot be damaged by Spikes."},{"Name":"Libero","Desc":"Changes the Pokemon's type to the type of the move it is about to use. This works only once each time the Pokemon enters battle."},{"Name":"Light Metal","Desc":"The user's weight is halved."},{"Name":"Lightning Rod","Desc":"The user draws in all Electric type moves. Electric-type moves cannot damage the user but instead will boost its Special Attack by one stage."},{"Name":"Limber","Desc":"The user cannot be paralyzed."},{"Name":"Lingering Aroma","Desc":"Contact with the Pokémon change the attacker's ability to Lingering Aroma."},{"Name":"Liquid Ooze","Desc":"Opponents who use draining moves on the user lose HP instead of recovering."},{"Name":"Magic Bounce","Desc":"The user reflects moves that change the status of Pokemom."},{"Name":"Magician","Desc":"The user steals the held item of a Pokemon it hits with a move."},{"Name":"Magma Armor","Desc":"The user cannot be frozen."},{"Name":"Magnet Pull","Desc":"Prevents Steel-type Pokemon from escaping."},{"Name":"Marvel Scale","Desc":"Increases the user's Defense by 50% when afflicted with a status condition."},{"Name":"Mega Launcher","Desc":"Increases the damage of Aura and Pulse moves by 50%."},{"Name":"Merciless","Desc":"The user's attacks become critical hits if the user is poisoned."},{"Name":"Minus","Desc":"Increases the user's Special Attack if an ally Plus or Minus is also in the battlefield."},{"Name":"Mirror Armor","Desc":"The user reflects stat lowering effects it receives."},{"Name":"Mold Breaker","Desc":"The user can use moves without getting affected by the opponent's Abilities."},{"Name":"Moody","Desc":"The user increases a random stat by two stages and lowers another by one stage at the end of each turn."},{"Name":"Moxie","Desc":"The user's Attack is increased by one stage whenever it knocks out another Pokemon."},{"Name":"Multiscale","Desc":"Reduces amount of the damage the user receives by 50% if its HP is full."},{"Name":"Mycelium Might","Desc":"All status moves used by the Pokemon have decreased priority, and will ignore the Ability of the target."},{"Name":"Natural Cure","Desc":"Heals the user of status condition when it switches out of battle."},{"Name":"No Guard","Desc":"The user ensures that all outgoing and incoming attacks will never miss."},{"Name":"Oblivious","Desc":"The user cannot be infatuated, intimidated, or be taunted."},{"Name":"Opportunist","Desc":"The Pokemon copies any stat boosts of its opponent."},{"Name":"Orichalcum Pulse","Desc":"The user changes the weather to Harsh Sunlight for five turns, and boosts its Attack stat by 30% while said weather is active."},{"Name":"Overcoat","Desc":"Protects the user from the effects of Weather and Powder Moves."},{"Name":"Overgrow","Desc":"Increases the damage of Grass-type moves by 50% when the user's HP is below 1/3 its max."},{"Name":"Own Tempo","Desc":"The user cannot be confused and cannot be affected by Intimidate."},{"Name":"Pickpocket","Desc":"The user steals an item from an attacker that makes direct contact."},{"Name":"Pickup","Desc":"Has a 10% chance of finding an item after battle or even outside battle."},{"Name":"Pixilate","Desc":"Increases the damage of Normal-type moves by 20% and turns them into Fairy-type instead."},{"Name":"Plus","Desc":"Increases the user's Special Attack if an ally Plus or Minus is also in the battlefield."},{"Name":"Poison Heal","Desc":"The user heals 12.5% of its max HP while poisoned at the end of each turn instead of taking damage."},{"Name":"Poison Point","Desc":"Has a 30% chance to poison attackers that make direct contact with the user."},{"Name":"Poison Touch","Desc":"Has a 30% chance to poison opponents that the user attacks and makes direct contact with."},{"Name":"Power Spot","Desc":"Increases the power of ally Pokemon attacks by 30%."},{"Name":"Prankster","Desc":"Increases the Speed priority of status moves by 1. Moves affected by this ability are ineffective against Dark-type opponents."},{"Name":"Pressure","Desc":"When the user is hit with an opponent's move, that move loses 2 PP instead of 1."},{"Name":"Propeller Tail","Desc":"The user ignores abilities and moves that changes the target of moves."},{"Name":"Protean","Desc":"Changes the user's type to the type of the move it's about to use."},{"Name":"Protosynthesis","Desc":"If Harsh Sunlight is active or if it's holding Booster Energy, the Pokemon's highest stat is boosted by 30% if the stat is Attack, Defense, Special Attack, or Special Defense or 50% if the stat is Speed."},{"Name":"Psychic Surge","Desc":"The user applies Psychic Terrain to the battlefield for five turns when it enters a battle."},{"Name":"Punk Rock","Desc":"Increases the damage of Sound based moves by 30% and lowers the damage taken by the user from Sound based moves by 50%."},{"Name":"Pure Power","Desc":"The user's Attack stat is doubled during battle."},{"Name":"Purifying Salt","Desc":"The Pokemon is protected from being inflicted with status conditions and halves the damage taken from Ghost-type moves."},{"Name":"Quark Drive","Desc":"If Electric Terrain is active or if it's holding Booster Energy, the Pokemon's highest stat is boosted by 30% if the stat is Attack, Defense, Special Attack, or Special Defense or 50% if the stat is Speed."},{"Name":"Queenly Majesty","Desc":"Prevents the opponent from using moves with increased Speed priority on the user and their allies."},{"Name":"Quick Feet","Desc":"The user's Speed is increased by 50% when the user is affected by a status condition. Ignores the Speed drop from the Paralyzed status condition."},{"Name":"Rain Dish","Desc":"The user recovers 6.25% HP during Heavy Rain at the end of each turn."},{"Name":"Rattled","Desc":"Increases the user's Speed by one stage if the user gets hit by a Bug-type, Ghost-type, or Dark-type move or if the user gets Intimidated."},{"Name":"Receiver","Desc":"The user copies the ability of an ally that fainted in battle."},{"Name":"Reckless","Desc":"Increases the damage of moves that have recoil damage by 20%."},{"Name":"Regenerator","Desc":"The user restores up to 1/3 of its max HP when switched out of battle."},{"Name":"Ripen","Desc":"The user ripens Berries doubles their effectiveness."},{"Name":"Rivalry","Desc":"The user's Attack and Special Attack is increased by 25% if the opponent is the same gender but is decreased by 25% instead if the opponent is the opposite gender."},{"Name":"Rock Head","Desc":"The user takes receives no recoil damage from recoil damage causing effects."},{"Name":"Rocky Payload","Desc":"Boosts the power of Rock-type moves by 50%."},{"Name":"Rough Skin","Desc":"The attacker takes 12.5% of its max HP worth of damage when it makes direct contact with the user."},{"Name":"Run Away","Desc":"Ensures escape from wild Pokemon but the user cannot switch under the effects of Mean Look or Block."},{"Name":"Sand Force","Desc":"Increases the damage of the user's Ground-type, Rock-type, and Steel-type moves by 30% during a Sandstorm and the user takes no damage from the Sandstorm."},{"Name":"Sand Rush","Desc":"The user's Speed is doubled during a Sandstorm."},{"Name":"Sand Spit","Desc":"The user creates a Sandstorm whenever it gets hit by an attack."},{"Name":"Sand Stream","Desc":"The user creates a Sandstorm that lasts for 5 turns when it enters the battlefield."},{"Name":"Sand Veil","Desc":"Increases the user's Evasion by one stage during a Sandstorm."},{"Name":"Sap Sipper","Desc":"Increases the user's Attack by one stage if the user gets hit with a Grass-type move, also the user takes no damage from Grass-type attacks."},{"Name":"Scrappy","Desc":"The user can hit Ghost-type Pokemon with Normal-type and Fighting-type moves, the user also becomes unaffected by Intimidate."},{"Name":"Seed Sower","Desc":"Summons Grassy Terrain in the field which lasts for five turns when the Pokemon is hit by an attack."},{"Name":"Serene Grace","Desc":"Doubles the chances of the user's moves with secondary effects of happening."},{"Name":"Shadow Tag","Desc":"Prevents the opponent from escaping or switching out while the user is on the battlefield."},{"Name":"Sharpness","Desc":"Boosts the power of slicing moves by 50%."},{"Name":"Shed Skin","Desc":"The user has a 33% chance of healing from status conditions at the end of each turn."},{"Name":"Sheer Force","Desc":"Moves with additional effects get an increase in damage by 30% but lose their additional effects in favor of extra damage."},{"Name":"Shell Armor","Desc":"The user is protected from critical hits."},{"Name":"Shield Dust","Desc":"The user blocks the additional effects of attacks it receives."},{"Name":"Simple","Desc":"The user doubles the effects of stat changes."},{"Name":"Skill Link","Desc":"Moves that hit 2-5 times will always strike 5 times."},{"Name":"Slow Start","Desc":"The user's Attack and Speed stats are cut in half for 5 turns after being sent out in battle."},{"Name":"Slush Rush","Desc":"Doubles the user's Speed in a Hailstorm."},{"Name":"Snow Cloak","Desc":"Increases the user's Evasion by one stage during a Hailstorm."},{"Name":"Snow Warning","Desc":"The user creates a Hailstorm that lasts for 5 turns after being sent out in battle."},{"Name":"Solar Power","Desc":"Increases the user's Special Attack by 50% but HP decreases by 12.5% of its max HP at the end of every turn."},{"Name":"Solid Rock","Desc":"Damage taken by the user from super effective attacks are decreased by 25%."},{"Name":"Soundproof","Desc":"The user is unaffected by Sound-based moves."},{"Name":"Speed Boost","Desc":"Increases the user's Speed by one stage at the end of each turn."},{"Name":"Stakeout","Desc":"Doubles the damage dealt by the user to the opponent switching in to the battlefield."},{"Name":"Stall","Desc":"The user always attacks last."},{"Name":"Stamina","Desc":"Increases the user's Defense by one stage each time it gets hit by an attack."},{"Name":"Static","Desc":"Has a 30% chance to paralyze opponents that come into direct contact with the user."},{"Name":"Steadfast","Desc":"Increases the user's Speed by one stage each time it flinches."},{"Name":"Steam Engine","Desc":"Increases the user's Speed by 6 stages if the user gets hit with a Fire-type or Water-type move."},{"Name":"Steely Spirit","Desc":"Increases the damage of the user and ally's Steel-type moves by 50%."},{"Name":"Stench","Desc":"Has a 10% chance of causing the opponent to flinch after getting damaged by the user."},{"Name":"Sticky Hold","Desc":"The user's Held item cannot be taken by other Pokemon."},{"Name":"Storm Drain","Desc":"The user draws in all Water-type moves. Water-type moves cannot damage the user but instead will boost its Special Attack by one stage."},{"Name":"Strong Jaw","Desc":"Increases the damage of the user's Biting moves by 50%."},{"Name":"Sturdy","Desc":"The user cannot be knocked out with one hit and cannot be knocked out by One hit KO moves, causing the Pokemon to have 1 HP remaining."},{"Name":"Super Luck","Desc":"Increases the critical hit ratio of moves by one stage."},{"Name":"Supreme Overlord","Desc":"The Pokemon's Attack and Special Attack stats receive a 10% boost for each fainted member in the party."},{"Name":"Swarm","Desc":"Increases the damage of Bug-type moves by 50% when the user's HP is below 1/3 its max."},{"Name":"Sweet Veil","Desc":"Prevents the user and allies from falling asleep."},{"Name":"Swift Swim","Desc":"Doubles the Speed of the user in rain."},{"Name":"Sword of Ruin","Desc":"Lowers the Defense stat of all Pokemon in the field by 25%."},{"Name":"Symbiosis","Desc":"The user passes its Held item to an ally if the ally uses up its Held item."},{"Name":"Synchronize","Desc":"The opponent receives the same status condition it gives to the user."},{"Name":"Tablets of Ruin","Desc":"Lowers the Attack stat of all Pokemon in the field by 25%."},{"Name":"Tangled Feet","Desc":"Increases the user's Evasion by one stage when it gets Confused."},{"Name":"Technician","Desc":"Increases the damage of the user's moves with a Base Power less than 60 by 50%."},{"Name":"Telepathy","Desc":"The user dodges attacks from allies."},{"Name":"Thermal Exchange","Desc":"The Pokemon's Attack stat is raised by one stage if it is hit by a Fire-type move. The Pokemon also cannot be burned."},{"Name":"Thick Fat","Desc":"Damage received from Fire-type and Ice-type moves is reduced to 50%."},{"Name":"Tinted Lens","Desc":"Doubles the damage of \"not very effective\" moves of the user."},{"Name":"Torrent","Desc":"Increases the damage of Water-type moves by 50% when the user's HP is below 1/3 its max."},{"Name":"Tough Claws","Desc":"Increases the damage of moves that make physical contact by 30%."},{"Name":"Toxic Boost","Desc":"Increases the user's Attack by 50% when the user gets poisoned."},{"Name":"Toxic Debris","Desc":"When hit by a physical move, the Pokemon scatters Toxic Spikes in the opposing field. The effect can activate a maximum of two times."},{"Name":"Trace","Desc":"The user copies the opponent's Ability."},{"Name":"Truant","Desc":"The user can't use moves on consecutive turns."},{"Name":"Unaware","Desc":"The user ignores the opponent's stat changes when attacking."},{"Name":"Unburden","Desc":"Doubles the user's Speed once it uses its Held item."},{"Name":"Unnerve","Desc":"Prevents the opponent from using its Held Berry."},{"Name":"Vessel of Ruin","Desc":"Lowers the Special Attack stat of all Pokemon in the field by 25%."},{"Name":"Vital Spirit","Desc":"The user cannot fall asleep."},{"Name":"Volt Absorb","Desc":"The user restores up to 25% of its max HP instead of taking damage when hit with Electric-type moves."},{"Name":"Water Absorb","Desc":"The user restores up to 25% of its max HP instead of taking damage when hit with Water-type moves."},{"Name":"Water Compaction","Desc":"Increases the user's Defense by two stages every time it gets hit by a Water type move."},{"Name":"Water Veil","Desc":"The user can't get burned."},{"Name":"Weak Armor","Desc":"Increases the user's Speed by two stages when it gets hit by a physical attack but lowers the user's Defense by one stage."},{"Name":"Well-Baked Body","Desc":"The Pokemon takes no damage from Fire-type moves, and its Defense stat is raised by two stages if hit by a Fire-type attack."},{"Name":"White Smoke","Desc":"Other Pokemon cannot lower the user's stats."},{"Name":"Wind Power","Desc":"The Pokemon becomes charged and boosts the damage of the next Electric-type move it uses when it is hit by a wind move."},{"Name":"Wind Rider","Desc":"The Pokemon takes no damage from wind moves, and its Attack stat is raised by one stage if Tailwind is in effect or if it is hit by a wind move"},{"Name":"Wonder Skin","Desc":"Lowers the accuracy of status inducing moves targeted at the user by 50%."},{"Name":"Zero to Hero","Desc":"When switched out, the Pokemon transforms into its Hero Form which lasts until the end of the battle."}]
